# Assignment -1

In [1]:
import pandas as pd
import numpy as np

Import the dataset from this(https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

df = pd.read_csv(url, sep= "|")

In [3]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

Assign it to a variable called users and use the 'user_id' as index

In [4]:
df = df.set_index('user_id')

df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

See the first 10 and last 10 entries

In [6]:
print('First 10 entries :')
df.head(10)

First 10 entries :

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [7]:
print('Last 10 entries:')
df.head(10)

Last 10 entries:

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

What is the number of observations in the dataset?

In [8]:
df.count()

age           943
gender        943
occupation    943
zip_code      943
dtype: int64

What is the number of columns in the dataset?

In [10]:
print('Number of columns :', df.shape[1])

Number of columns : 4

Print the name of all the columns.

In [11]:
print('Name of all the columns:',(df.columns))

Name of all the columns: Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

How is the dataset indexed?

In [12]:
index= df.Index()

AttributeError: 'DataFrame' object has no attribute 'Index'

What is the data type of each column?

In [13]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

Print only the occupation column

In [14]:
print(df['occupation'])

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

How many different occupations are in this dataset?

In [15]:
df['occupation'].nunique()

21

What is the most frequent occupation?

In [16]:
df['occupation'].value_counts(ascending=False).head(1)

student    196
Name: occupation, dtype: int64

DataFrame Info.

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

Describe all the columns

In [19]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

Summarize only the occupation column

In [18]:
df['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64


What is the mean age of users?

In [21]:
df['age'].mean()

34.05196182396607

What is the age with least occurrence?

In [23]:
df['age'].value_counts().idxmin()

7